Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Provides an up-down control to the right of the control to modify date-time values, which replaces the of the drop-down month calendar that would otherwise be available.
ja: コントロールの右側に日付-時刻の値を変更するためのアップダウンコントロールを提供します。

source: Provides only a Ptr property, which allows the object to be passed to DllCall or ComCall.
ja: Ptrプロパティのみを提供し、DllCallまたはComCallにオブジェクトを渡すことができます。

source: Provides unlimited number of private, named clipboards to Copy, Cut, Paste, Append or CutAppend of selected text.
ja: 選択したテキストをコピー、カット、ペースト、アペンド、カットアペンドするためのプライベートな名前付きクリップボードを無制限に提供することができます。

source: Providing a full explanation of what each construct does would require introducing more concepts which are outside the scope of this section.
ja: 各コンストラクトがどのような働きをするのか、詳しく説明するためには、さらに多くの概念を導入する必要があり、このセクションの範囲外です。

source: Pseudo-arrays
ja: 疑似配列

source: Pun aside, this is a mostly functional example.
ja: 駄洒落はさておき、これはほぼ機能的な例です。

source: Pure Numbers
ja: 純粋数

source: Purple
ja: Purple（紫）

source: Push method
ja: Pushメソッド

source: Puts the icon on the right side of the column rather than the left.
ja: アイコンを列の左側ではなく、右側に配置します。

source: Putting options inside a hotstring's first pair of colons.
ja: ホットストリングの最初のコロンのペアの間にオプションを挟みます。

source: Q should be followed by a number from the following table:
ja: Qの後には、次の表から番号を選んでください：

source: Qualifying AutoHotkey .exe files and all .bin files are searched for in the compiler's directory, the compiler's parent directory, and any of the compiler's sibling directories with directory names that start with AutoHotkey or V, but do not start with AutoHotkey_H.
ja: 修飾されたAutoHotkeyの.exeファイルとすべての.binファイルは、コンパイラのディレクトリ、コンパイラの親ディレクトリ、およびAutoHotkeyまたはVで始まり、AutoHotkey_Hで始まらないディレクトリ名を持つコンパイラの兄弟ディレクトリで検索されます。

source: Queries a COM object for an interface or service.
ja: COMオブジェクトにインターフェースやサービスを問い合わせる。

source: Quick Reference
ja: クイックリファレンス

source: Quick Reference | AutoHotkey v2
ja: クイックリファレンス｜AutoHotkey v2

source: Quick Reference:
ja: クイック・リファレンス

source: Quick reference visibility:
ja: クイックリファレンスの視認性：

source: Quickly sorts the contents of a file.
ja: ファイルの中身を素早くソートします。

source: Quotation marks cannot be omitted.
ja: クオーテーションマークは省略できません 。

source: Quotation marks can be omitted.
ja: クオーテーションマークは省略できます。

source: Quote Marks and Spaces
ja: 引用符とスペース

source: Quote marks are automatically escaped (i.e. they are interpreted as literal characters) if the continuation section starts inside a quoted string, as in the examples above.
ja: 上記の例のように、引用符で囲まれた文字列の中で継続セクションが始まる場合、引用符は自動的にエスケープされる（つまり、リテラル文字として解釈される）。

source: Quote marks are automatically escaped (i.e. they are interpreted as literal characters) if the continuation section starts inside a quoted string.
ja: 引用符は、継続部分が引用符で囲まれた文字列の中で始まる場合、自動的にエスケープされます（すなわち、リテラル文字として解釈されます）。

source: Quoted literal "0" is considered false.
ja: 引用されたリテラル"0"は偽とみなされます。

source: Quoted literal strings and strings produced by concatenating with quoted literal strings are no longer unconditionally considered non-numeric.
ja: 引用リテラル文字列および引用リテラル文字列を連結した文字列は、無条件に非数値と見なされなくなりました。

source: Quoted literal strings can be written with "double" or 'single' quote marks, but must begin and end with the same mark.
ja: 引用リテラル文字列は、"ダブル"または'シングル'の引用符で書くことができますが、同じ符で始まり、同じ符で終わらなければなりません。

source: Quoted strings can contain other escape sequences such as `t (tab), `n (linefeed), and `r (carriage return).
ja: 引用符で囲まれた文字列には、`t（タブ）、`n（ラインフィード）、`r（キャリッジリターン）といった他のエスケープシーケンスを含めることができます。

source: Quoted strings cannot span multiple lines using this method alone.
ja: 引用符で囲まれた文字列は、この方法だけでは複数行にまたがることはできない。

source: R = Recurse into subdirectories (subfolders).
ja: R = サブディレクトリ（サブフォルダ）に再帰します。

source: R = Subfolders are recursed into so that files and folders contained therein are operated upon if they match FilePattern.
ja: R = サブフォルダを再帰的に検索し、FilePatternに一致するファイルおよびフォルダを操作します。

source: RControl & Enter::ShiftAltTab ; Without even having to release right-control, press Enter to reverse direction.
ja: RControl & Enter::ShiftAltTab ; 右クリックを離すことなく、Enterキーを押すと方向が反転します。

source: RControl & RShift::AltTab ; Hold down right-control then press right-shift repeatedly to move forward.
ja: RControl & RShift::AltTab ; 右コンを押しながら、右シフトを繰り返し押して前進します。

source: RControl (or RCtrl)
ja: RControl（またはRCtrl）

source: RControl::Send "^c!{tab}^v" ; Copy the Calculator's result into the previously active window.
ja: RControl::Send "^c!{tab}^v" ; 電卓で計算した結果を、それまでアクティブだったウィンドウにコピーします。

source: RControl::Send "^s" ; Save the current file in Notepad.
ja: RControl::Send "^s" ; 現在のファイルをメモ帳に保存します。

source: REG_DWORD values are always expressed as positive decimal numbers.
ja: REG_DWORDの値は、常に正の10進数で表されます。

source: REG_SZ, REG_EXPAND_SZ, REG_MULTI_SZ, REG_DWORD, and REG_BINARY.
ja: REG_SZ、REG_EXPAND_SZ、REG_MULTI_SZ、REG_DWORD、REG_BINARY。

source: Raised when a ListView or TreeView item is checked or unchecked.
ja: ListViewまたはTreeViewのアイテムがチェックされたとき、またはチェックされていないときに発生します。

source: Raised when a ListView or TreeView item is selected, or a ListView item is deselected.
ja: ListViewまたはTreeViewのアイテムが選択されたとき、またはListViewのアイテムが選択解除されたときに発生します。

source: Raised when a ListView or TreeView item's label is edited by the user.
ja: ListView または TreeView のアイテムのラベルがユーザーによって編集されたときに発生します。

source: Raised when a TreeView item is expanded or collapsed.
ja: TreeView のアイテムが展開または折りたたまれたときに発生します。

source: Raised when one of the ListView's column headers is clicked.
ja: ListViewのカラムヘッダーの1つがクリックされたときに発生します。

source: Raised when the control gains or loses the keyboard focus.
ja: コントロールがキーボードフォーカスを獲得したとき、または失ったときに発生します。

source: Raised when the control is clicked.
ja: コントロールがクリックされたときに発生します。

source: Raised when the control is double-clicked.
ja: コントロールがダブルクリックされたときに発生します。

source: Raised when the control's value changes.
ja: コントロールの値が変化したときに発生します。

source: Raised when the focused item changes in a ListView.
ja: ListView でフォーカスされている項目が変更されたときに発生します。

source: Raised when the user right-clicks the control or presses Menu or Shift+F10 while the control has the keyboard focus.
ja: コントロールにキーボードフォーカスがある状態で、ユーザーがコントロールを右クリックするか、MenuまたはShift+F10を押したときに発生します。

source: Raised when...
ja: 育てたのは...

source: Rajat created this script.
ja: このスクリプトを作ったのはラジャットです。

source: Random - Syntax & Usage | AutoHotkey v2
ja: Random - 構文と使用法｜AutoHotkey v2

source: Rather than using StatusBarGetText in a loop, it is usually more efficient to use StatusBarWait, which contains optimizations that avoid the overhead of repeated calls to StatusBarGetText.
ja: 通常、ループ内でStatusBarGetTextを使用するよりも、StatusBarGetTextを繰り返し呼び出すことによるオーバーヘッドを回避する最適化を含む StatusBarWait を使用する方が効率的です。

source: Re-enables the hotkeys and hotstrings that were disable above.
ja: 上記で無効にしたホットキーとホットストリングを再度有効にします。

source: Reading Binary Data
ja: バイナリデータの読み取り

source: Reading into a Buffer is recommended.
ja: Bufferへの読み込みを推奨します。

source: Reading the value of a variable which has not been assigned a value is considered an error.
ja: 値を割り当てられていない変数の値を読み込もうとするとエラーになります。

source: Reads a line of text from the file and advances the file pointer.
ja: ファイルからテキストを1行読み出し、ファイルポインタを進める。

source: Reads a number from the file and advances the file pointer.
ja: ファイルから数値を読み出し、ファイルポインタを進める。

source: Reads a string of characters from the file and advances the file pointer.
ja: ファイルから文字列を読み出し、ファイルポインタを進める。

source: Reads a text file into MyText.
ja: テキストファイルをMyTextに読み込みます。

source: Reads a value from the registry and store it in TestValue.
ja: レジストリから値を読み取り、TestValueに格納します。

source: Reads a value from the registry.
ja: レジストリから値を読み込みます。

source: Reads a value, section or list of section names from a standard format .ini file.
ja: 標準フォーマットの.iniファイルから値、セクション、またはセクション名のリストを読み込みます。

source: Reads raw binary data from the file into memory and advances the file pointer.
ja: ファイルから生のバイナリデータをメモリに読み込んで、ファイルポインタを進める。

source: Reads the current item.
ja: 現在の項目を読み取ります。

source: Reads the lines inside a variable, one by one (similar to a file-reading loop).
ja: 変数内の行を1行ずつ読み込みます（ファイル読み込みループに似ています）。

source: Reads the value of a key located in section2 from a standard format .ini file and stores it in Value.
ja: 標準フォーマットの.iniファイルからsection2にあるキーの値を読み出し、Valueに格納します。

source: Real-time diagnostics (detecting common errors)
ja: リアルタイム診断（一般的なエラーの検出）

source: Realtime (or R)
ja: Realtime（またはR）

source: Receives a custom message and up to two numbers from some other script or program (to send strings rather than numbers, see the example after this one).
ja: 他のスクリプトやプログラムから、カスタムメッセージと最大2つの数字を受信する（数字ではなく文字列を送信する場合は、この後の例を参照してください）。

source: Recognizes unusual keys not mentioned above.
ja: 上記以外の珍しいキーも認識します。

source: Recommended dimensions of a small icon, in pixels.
ja: 小さなアイコンの推奨寸法（ピクセル単位）。

source: Recommended for new scripts due to its superior speed and reliability.
ja: 速度や信頼性に優れているため、新しいスクリプトにおすすめです。

source: Reconfigure the software that came with your mouse or keyboard (sometimes accessible in the Control Panel or Start Menu) to have the "mystery key" send some other keystroke.
ja: マウスやキーボードに付属のソフトウェア（コントロールパネルやスタートメニューからアクセスできる場合もあります）を再設定して、「いずれかのキー」が他のキーストロークを送信するようにします。

source: Record and play back a keyboard macro or mouse macro with this free macro program.
ja: この無料のマクロプログラムで、キーボードマクロやマウスマクロを記録・再生できます。

source: Rect := Buffer(16) ; Set capacity to hold four 4-byte integers.
ja: Rect := Buffer(16) ; 4バイトの整数を4つ保持する容量を設定します。

source: Rect := Buffer(16) ; A RECT is a struct consisting of four 32-bit integers (i.e. 4*4=16).
ja: Rect := Buffer(16) ; RECTは，4つの32ビット整数（4*4=16）からなる構造体である．

source: Recurses through all .ini files on the C drive and turns on their "archive" attribute.
ja: Cドライブ上のすべての.iniファイルを再帰的に検索してその「アーカイブ」属性をオンにします。

source: Recursively searches the entire registry for particular value(s).
ja: レジストリ全体から特定の値を再帰的に検索します。

source: Recycle Bin
ja: ごみ箱

source: Red
ja: Red（赤）

source: Redirecting to docs/.
ja: docs/にリダイレクトする。

source: Redraws the region of the GUI window occupied by the control.
ja: コントロールが占有するGUIウィンドウの領域を再描画します。

source: Redraws the specified window.
ja: 指定したウィンドウを再描画します。

source: Reduce the master volume.
ja: マスターボリュームを小さくする。

source: Reduce wear and tear on your fingers
ja: 指の摩耗を軽減する

source: Reduce wear and tear on your fingers by using virtually any key as a hotkey, including single letters, arrow keys, Numpad keys, and even the modifier keys themselves (Ctrl, Alt, Win, and Shift).
ja: アルファベット1文字、矢印キー、テンキー、修飾キー（Ctrl、Alt、Win、Shift）など、ほぼすべてのキーをホットキーとして使用できるため、指の消耗を抑えることができます。

source: Refactored code to support a build configuration for AutoHotkey as a DLL.
ja: DLL として AutoHotkey のビルド設定をサポートするようにコードをリファクタリングしました。

source: Refer to the Microsoft documentation for details.
ja: 詳細については、マイクロソフトのドキュメントを参照してください。

source: Refer to the Windows SDK header files to identify the correct method index.
ja: 正しいメソッド・インデックスを特定するために、Windows SDKヘッダーファイルを参照すること。

source: Refer to the v1.1 documentation for details.
ja: 詳細はv1.1のドキュメントを参照してください。

source: Reference Counting
ja: 参照カウント

source: Reference-Counting
ja: リファレンス・カウント

source: References to Objects
ja: オブジェクトへの参照

source: References to output variables in which to store the X and Y coordinates of the client area's upper left corner.
ja: クライアント領域の左上隅のX座標とY座標を格納する出力変数への参照。

source: References to output variables in which to store the width and height of the client area.
ja: クライアント領域の幅と高さを格納する出力変数への参照。

source: References to the output variables in which to store Control's width and height (in pixels).
ja: Controlの幅と高さ（ピクセル）を格納する出力変数へのリファレンス。

source: References to the output variables in which to store the X and Y coordinates (in pixels) of Control's upper left corner.
ja: コントロールの左上隅のX座標とY座標（ピクセル）を格納する出力変数への参照。

source: References to the output variables in which to store the X and Y coordinates of the first pixel that matches ColorID (if no match is found, the variables are made blank).
ja: ColorIDに一致する最初のピクセルの X 座標と Y 座標を格納する出力変数への参照（一致しない場合、変数は空白にされます）。

source: References to the output variables in which to store the X and Y coordinates of the target window's upper left corner.
ja: ターゲットウィンドウの左上隅のX座標とY座標を格納する出力変数への参照。

source: References to the output variables in which to store the X and Y coordinates of the upper-left pixel of where the image was found on the screen (if no match is found, the variables are made blank).
ja: 画面上で画像が見つかった場所の左上ピクセルのX、Y座標を格納する出力変数への参照（一致しない場合は空白とする）。

source: References to the output variables in which to store the X and Y coordinates.
ja: X、Y座標を格納する出力変数への参照。

source: References to the output variables in which to store the bounding coordinates of the working area, in pixels.
ja: 作業領域の境界座標をピクセル単位で格納する出力変数へのリファレンス。

source: References to the output variables in which to store the bounding coordinates, in pixels.
ja: 境界座標を格納する出力変数への参照（ピクセル単位）。

source: References to the output variables in which to store the width and height of the target window.
ja: ターゲットウィンドウの幅と高さを格納する出力変数への参照。

source: Referring to or calling the class for the first time causes it to be initialized.
ja: 初めて参照または呼び出すと、クラスが初期化されます。

source: Refresh
ja: 更新

source: RegCreateKey - Syntax & Usage | AutoHotkey v2
ja: RegCreateKey - 構文と使用法｜AutoHotkey v2

source: RegDelete - Syntax & Usage | AutoHotkey v2
ja: RegDelete - 構文と使用法｜AutoHotkey v2

source: RegDelete deleted the subkey.
ja: RegDeleteでサブキーが削除されました。

source: RegDelete, RegRead and RegWrite now allow ValueName to be specified when KeyName is omitted:
ja: RegDelete、RegRead、RegWriteで、KeyNameが省略されている場合にValueNameを指定できるようになりました：

source: RegDeleteKey - Syntax & Usage | AutoHotkey v2
ja: RegDeleteKey - 構文と使用法｜AutoHotkey v2

source: RegEx Callout Functions
ja: RegEx コールアウト関数

source: RegEx also applies to ahk_class and ahk_exe, e.g. "ahk_class IEFrame" searches for any window whose class name contains IEFrame anywhere (this is because by default, regular expressions find a match anywhere in the target string).
ja: RegExはahk_classと ahk_exeにも適用されます。例えば、"ahk_class IEFrame"は、クラス名にIEFrameが含まれるウィンドウを検索します（デフォルトでは、正規表現はターゲット文字列のどこでもマッチを見つけるからです）。

source: RegEx callout functions can now be variadic.
ja: RegExのコールアウト関数が可変になりました。

source: RegEx callout functions may define up to 5 parameters:
ja: RegExコールアウト関数は、最大5つのパラメータを定義することができる：

source: RegEx callouts are currently supported only by RegExMatch and RegExReplace.
ja: RegExコールアウトは現在、RegExMatchと RegExReplaceでのみサポートされている。

source: RegEx callouts are executed on the current quasi-thread, but the previous value of A_EventInfo will be restored after the RegEx callout function returns.
ja: RegExコールアウトは現在の準スレッド上で実行されるが、RegExコールアウト関数が戻った後、A_EventInfoの以前の値が復元される。

source: RegEx callouts provide a means of temporarily passing control to the script in the middle of regular expression pattern matching.
ja: RegExコールアウトは、正規表現パターンマッチングの途中でスクリプトに一時的に制御を渡す手段を提供する。

source: RegEx examples:
ja: RegEx の例：

source: RegEx newline matching defaults to (*ANYCRLF) and (*BSR_ANYCRLF); `r and `n are recognized in addition to `r`n.
ja: RegEx の改行マッチングのデフォルトは (*ANYCRLF) と (*BSR_ANYCRLF) で、`r`n に加えて `r と `n が認識されます。

source: RegEx quick reference
ja: 正規表現クイックリファレンス

source: RegExMatch - Syntax & Usage | AutoHotkey v2
ja: RegExMatch - 構文と使用法｜AutoHotkey v2

source: RegExReplace - Syntax & Usage | AutoHotkey v2
ja: RegExReplace - 構文と使用法｜AutoHotkey v2

source: RegRead - Syntax & Usage | AutoHotkey v2
ja: RegRead - 構文と使用法｜AutoHotkey v2

source: RegRead had an undocumented 5-parameter mode, where the value type was specified after the output variable.
ja: RegReadには、出力変数の後に値の種類を指定する、文書化されていない5パラメータモードがありました。

source: RegRead read a value with the same name as the subkey, if one existed in the parent key.
ja: RegReadは、親キーにサブキーが存在する場合、そのサブキーと同じ名前の値を読み取ります。

source: RegWrite - Syntax & Usage | AutoHotkey v2
ja: RegWrite - 構文と使用法｜AutoHotkey v2

source: RegWrite returned an error.
ja: RegWriteはエラーを返しました。

source: RegWrite's parameters were reordered to put Value first, like IniWrite (but this doesn't affect the single-parameter mode, where Value was the only parameter).
ja: RegWriteのパラメータは、IniWriteのようにValueを最初に置くように並び替えました（ただし、Valueが唯一のパラメータだったシングルパラメータモードには影響しません）。

source: Regardless of the current match mode, WinTitle, WinText, ExcludeTitle and ExcludeText are case sensitive.
ja: 現在のマッチモードに関わらず、WinTitle、WinText、ExcludeTitle、ExcludeTextは大文字と小文字を区別する。

source: Regardless of the current match mode, WinTitle, WinText, ExcludeTitle and ExcludeText are case-sensitive.
ja: 現在のマッチモードに関わらず、WinTitle、WinText、ExcludeTitle、ExcludeTextは大文字と小文字を区別する。

source: Regardless of the default setting, timers will always operate when the script has no threads (unless Pause has been turned on).
ja: デフォルトの設定にかかわらず、スクリプトにスレッドがない場合、タイマーは常に動作する（一時停止がオンになっている場合を除く）。

source: Regardless of the particular mouse, Send and Click can be used to scroll horizontally in programs which support it.
ja: 特定のマウスに関係なく、Send と Click を使用して、それをサポートするプログラムで水平方向にスクロールできます。

source: Regardless of the value of StartingPos, the return value is always a complete copy of Haystack -- the only difference is that more of its left side might be unaltered compared to what would have happened with a StartingPos of 1.
ja: StartingPosの値にかかわらず、戻り値は常にHaystackの完全なコピーです。唯一の違いは、StartingPosが1の場合に起こるであろうことと比較して、その左側の多くが変更されていないかもしれないということです。

source: Regardless of the value of StartingPos, the return value is always relative to the first character of Haystack.
ja: StartingPosの値に関係なく、戻り値は常にHaystackの最初の文字からの相対値です。

source: Regardless of the values of StartingPos or Occurrence, the return value is always relative to the first character of Haystack.
ja: StartingPosやOccurrenceの値に関係なく、戻り値は常にHaystackの最初の文字に対する相対値です。

source: Regardless of this option, a negative class such as [^a] always matches newlines.
ja: このオプションに関係なく、[^a]のような否定クラスは常に改行にマッチする。

source: Regardless of this option, non-alphabetic backslash sequences that have no special meaning are always treated as literals (e.g. \/ and / are both recognized as forward-slash).
ja: このオプションに関係なく、特別な意味を持たない非アルファベットのバックスラッシュ シーケンスは常にリテラルとして扱われる（例：「\/」と「/」は両方ともフォワードスラッシュとして認識される）。

source: Regardless of this sub-function, a thread will become interruptible the moment it displays a MsgBox, InputBox, FileSelect, or DirSelect dialog.
ja: このサブ関数に関係なく、スレッドはMsgBox、InputBox、FileSelect、DirSelectダイアログを表示した瞬間に割り込み可能になる。

source: Regardless of whether an exception is thrown, A_LastError is set to the result of the operating system's GetLastError() function.
ja: 例外の発生有無にかかわらず、A_LastErrorにはオペレーティングシステムのGetLastError()関数の結果が設定されます。

source: RegisterCallback was renamed to CallbackCreate and changed to better utilize closures:
ja: RegisterCallbackはCallbackCreateに名称変更し、クロージャをより活用できるように変更しました：

source: Registers a function to be called automatically whenever the clipboard's content changes.
ja: クリップボードの内容が変更されるたびに自動的に呼び出される関数を登録します。

source: Registers a function or method to be called when a control notification is received via the WM_COMMAND message.
ja: WM_COMMANDメッセージで制御通知を受信したときに呼び出される関数やメソッドを登録します。

source: Registers a function or method to be called when a control notification is received via the WM_NOTIFY message.
ja: WM_NOTIFYメッセージで制御通知を受信したときに呼び出される関数やメソッドを登録します。

source: Registers a function or method to be called when the given event is raised.
ja: 与えられたイベントが発生したときに呼び出される関数またはメソッドを登録します。

source: Registers a function or method to be called when the given event is raised by a GUI window or control.
ja: GUIウィンドウやコントロールからイベントが発生したときに呼び出される関数やメソッドを登録します。

source: Registers a method to be called on exit.
ja: 終了時に呼び出されるメソッドを登録します。

source: Registers the UIAccess shell verb, which appears in Explorer's context menu as "Run with UI access".
ja: エクスプローラーのコンテキストメニューに「UIアクセスで実行」として表示されるUIAccessシェル動詞を登録する。

source: Registry functions (RegRead, RegWrite, RegDelete):
ja: レジストリ関数（RegRead、RegWrite、RegDelete）：

source: Registry functions (RegRead, RegWrite, RegDelete): the new syntax added in v1.1.21+ is now the only syntax.
ja: レジストリ関数（RegRead、RegWrite、RegDelete）：v1.1.21+で追加された新しい構文が唯一の構文となりました。

source: Registry remapping is generally more pure and effective than AutoHotkey's remapping.
ja: レジストリの再マッピングは、一般的にAutoHotkeyの再マッピングよりも純粋で効果的です。

source: Registry remapping is relatively permanent:
ja: レジストリの再マッピングは比較的永続的である：

source: Registry remapping is relatively permanent: a reboot is required to undo the changes or put new ones into effect.
ja: レジストリの再マッピングは比較的永続的である：変更を元に戻したり、新しい変更を有効にするには再起動が必要です。

source: Regular Expression Callouts
ja: 正規表現の吹き出し

source: Regular Expression Callouts | AutoHotkey v2
ja: 正規表現の吹き出し｜AutoHotkey v2

source: Regular Expressions (RegEx) - Quick Reference
ja: 正規表現（RegEx） - クイックリファレンス

source: Regular Expressions (RegEx) - Quick Reference | AutoHotkey v2
ja: 正規表現（RegEx） - クイックリファレンス｜AutoHotkey v2

source: Related
ja: 関連

source: Related Topics
ja: 関連する話題

source: Related topic:
ja: 関連トピック

source: Related topic: ContextMenu event
ja: 関連トピック：ContextMenuイベント

source: Related topic: OnExit
ja: 関連トピック：OnExit

source: Related topic: context-sensitive hotstrings.
ja: 関連トピック：コンテキストに応じたホットストリング。

source: Related topic: window's margin.
ja: 関連トピック：ウィンドウのマージン。

source: Related topics:
ja: 関連トピック：

source: Related:
ja: 関連：

source: Related: Bitwise-not (~)
ja: 関連：ビットワイズ・ノット（~）

source: Related: ControlGetClassNN
ja: 関連：ControlGetClassNN

source: Related: list of built-in variables.
ja: 関連：組み込み変数のリスト。

source: Relative paths in command line parameters are often also relative to this directory, but that depends on the program.
ja: コマンドラインパラメータの相対パスもこのディレクトリからの相対パスであることが多いが、それはプログラムによって異なる。

source: Release
ja: リリース

source: Release it to return to original speed.
ja: 離すと元の速度に戻ります。

source: Release the mouse button (i.e. generate an up-event).
ja: マウスボタンを離す（つまりアップイベントを発生させる）。

source: Releases the right mouse button.
ja: マウスの右ボタンを離します。

source: Reliability
ja: 信頼性

source: Reliability is further improved by the fact that anything the user types during a SendInput is postponed until afterward.
ja: SendInput中にユーザーが入力したものは、その後まで延期されるため、信頼性はさらに向上します。

source: Reload - Syntax & Usage | AutoHotkey v2
ja: Reload - 構文と使用法｜AutoHotkey v2

source: Reload Script - See Reload.
ja: Reload Script -リロードを参照。

source: Reloading
ja: リローディング

source: Remap easy to reach but rarely used keys
ja: 手は届きやすいがあまり使わないキーを別のキーに割り当てます

source: Remap keys manually by creating a .reg file (plain text) and loading it into the registry.
ja: .regファイル（プレーンテキスト）を作成し、レジストリにロードすることで、手動でキーを再マップする。

source: Remapped keys will auto-repeat while being held down (except keys remapped to become mouse buttons).
ja: リマップされたキーは、押したまま自動リピートされます（マウスボタンにリマップされたキーを除く）。

source: Remapping Keys
ja: キーのリマッピング

source: Remapping Keys (Keyboard, Mouse and Controller) | AutoHotkey v2
ja: リマッピングキー（キーボード、マウス、コントローラ）｜AutoHotkey v2

source: Remapping Keys (Keyboard, Mouse and Controller)
ja: キーのリマッピング（キーボード、マウス、コントローラー）

source: Remapping a Controller to Keyboard or Mouse
ja: コントローラをキーボードまたはマウスにリマップする

source: Remapping a Controller to Keyboard or Mouse | AutoHotkey v2
ja: コントローラをキーボードまたはマウスにリマップする｜AutoHotkey v2

source: Remapping a controller
ja: コントローラーのリマッピング

source: Remapping a key or button is "complete" in the following respects:
ja: キーやボタンのリマッピングは、以下の点で「完了」となります：

source: Remapping keys and buttons
ja: キーとボタンのリマッピング

source: Remapping the Keyboard and Mouse
ja: キーボードとマウスのリマッピング

source: Remapping the keyboard and mouse
ja: キーボードとマウスのリマッピング

source: Remapping via the Registry's "Scancode Map"
ja: レジストリの「スキャンコードマップ」によるリマッピング

source: Remapping.
ja: リマッピングです。

source: Remaps a key or mouse button (this is only for illustration because it would be easier to use the built-in remapping feature).
ja: キーやマウスのボタンをリマップする（内蔵のリマップ機能を使った方が簡単なので、これは説明のためです）。

source: Remarks
ja: 備考

source: Remember that the offset of a field is usually the total size of all fields preceding it.
ja: フィールドのオフセットは、通常、そのフィールドに先行するすべてのフィールドの合計サイズであることを忘れないでください。
